test/stress-test-report.txt
This is ApacheBench, Version 2.3 <$Revision: 1430300 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 94.191.26.194 (be patient)


Server Software:        
Server Hostname:        94.191.26.194
Server Port:            3000

Document Path:          /
Document Length:        3722 bytes

Concurrency Level:      100
Time taken for tests:   59.098 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      3822000 bytes
HTML transferred:       3722000 bytes
Requests per second:    16.92 [#/sec] (mean)
Time per request:       5909.825 [ms] (mean)
Time per request:       59.098 [ms] (mean, across all concurrent requests)
Transfer rate:          63.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  153 410.6      1    2401
Processing:     1 4187 11381.0    604   54410
Waiting:        1 3346 10844.5    203   52882
Total:          2 4340 11425.4    606   54410

Percentage of the requests served within a certain time (ms)
  50%    606
  66%   1216
  75%   1808
  80%   2413
  90%   6836
  95%  48168
  98%  48581
  99%  50078
 100%  54410 (longest request)